Revit 2027 API
RebarContainerParameterManager.RemoveOverride Method
 Removes an overridden value from the given parameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveOverride(
	ElementId paramId
)
Public Sub RemoveOverride (
	paramId As ElementId
)
public:
void RemoveOverride(
	ElementId^ paramId
)
member RemoveOverride :
        paramId : ElementId -> unit
Parameters
paramId ElementId
 The id of the parameter
Exceptions
Exception | Condition
ArgumentException |  paramId has no override
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace